       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARITHMETIC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  NUMERO-A PIC 9(5).
       01  NUMERO-B PIC 9(5).
       01  RESULTADO PIC 9(10).

       PROCEDURE DIVISION.
           ADD NUMERO-B TO NUMERO-A GIVING RESULTADO.
           DISPLAY "SUMA: " RESULTADO.

           SUBTRACT NUMERO-B FROM NUMERO-A GIVING RESULTADO.
           DISPLAY "RESTA: " RESULTADO.

           MULTIPLY NUMERO-A BY NUMERO-B GIVING RESULTADO.
           DISPLAY "MULTIPLICACION: " RESULTADO.

           DIVIDE NUMERO-A BY NUMERO-B GIVING RESULTADO.
           DISPLAY "DIVISION: " RESULTADO.

           COMPUTE RESULTADO = NUMERO-A + NUMERO-B * 2.
           DISPLAY "COMPUTE: " RESULTADO.

           STOP RUN.
